jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
/*
 * This file is part of the ZombieVerter project.
 *
 * Copyright (C) 2024 Tom de Bree <tom@voltinflux.com>
 * Copyright (C) 2010 Johannes Huebner <contact@johanneshuebner.com>
 * Copyright (C) 2010 Edward Cheeseman <cheesemanedward@gmail.com>
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2019-2022 Damien Maguire <info@evbmw.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#include <stdint.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/stm32/rtc.h>
#include <libopencm3/stm32/can.h>
#include <libopencm3/stm32/iwdg.h>
#include <libopencm3/stm32/spi.h>
#include <libopencm3/stm32/exti.h>
#include "stm32_can.h"
#include "terminal.h"
#include "params.h"
#include "hwdefs.h"
#include "digio.h"
#include "hwinit.h"
#include "anain.h"
#include "temp_meas.h"
#include "param_save.h"
#include "my_math.h"
#include "errormessage.h"
#include "printf.h"
#include "stm32scheduler.h"
#include "cansdo.h"
#include "leafinv.h"
#include "isa_shunt.h"
#include "BMW_E39.h"
#include "BMW_E65.h"
#include "subaruvehicle.h"
#include "Can_OI.h"
#include "outlanderinverter.h"
#include "Can_VAG.h"
#include "GS450H.h"
#include "throttle.h"
#include "utils.h"
#include "teslaCharger.h"
#include "i3LIM.h"
#include "CANSPI.h"
#include "chademo.h"
#include "heater.h"
#include "amperaheater.h"
#include "inverter.h"
#include "vehicle.h"
#include "chargerhw.h"
#include "canmap.h"
#include "terminalcommands.h"
#include "iomatrix.h"
#include "bmw_sbox.h"
#include "vag_sbox.h"
#include "NissanPDM.h"
#include "chargerint.h"
#include "notused.h"
#include "nocharger.h"
#include "extCharger.h"
#include "amperacharger.h"
#include "noHeater.h"
#include "bms.h"
#include "simpbms.h"
#include "leafbms.h"
#include "daisychainbms.h"
#include "outlanderCharger.h"
#include "Can_OBD2.h"
#include "dcdc.h"
#include "TeslaDCDC.h"
#include "BMW_E31.h"
#include "shifter.h"
#include "digipot.h"
#include "F30_Lever.h"
#include "E65_Lever.h"
#include "JLR_G1.h"
#include "JLR_G2.h"
#include "no_Lever.h"
#include "CPC.h"
#include "Foccci.h"
#include "NoInverter.h"
#include "linbus.h"
#include "VWheater.h"
#include "ElconCharger.h"
#include "rearoutlanderinverter.h"
#include "NoVehicle.h"
#include "V_Classic.h"
#include "kangoobms.h"
#include "OutlanderCanHeater.h"
#include "OutlanderHeartBeat.h"

#define PRECHARGE_TIMEOUT 5  //5s

#define PRINT_JSON 0


extern "C" void __cxa_pure_virtual()
{
    while (1);
}

static Stm32Scheduler* scheduler;
static bool chargeMode = false;
static bool chargeModeDC = false;
static bool ChgLck = false;
static CanHardware* canInterface[3];
static CanMap* canMap;
static ChargeModes targetCharger;
static ChargeInterfaces targetChgint;
static uint8_t ChgSet;
static uint8_t HeatSet;

static bool RunChg;
static bool RunPreHeat;

static uint8_t ChgHrs_tmp;
static uint8_t ChgMins_tmp;
static uint16_t ChgDur_tmp;
static uint32_t ChgTicks=0,ChgTicks_1Min=0;
static uint32_t PreheatTicks=0,PreheatTicks_1Min=0;
static uint8_t PreHeatHrs_tmp;
static uint8_t PreHeatMins_tmp;
static uint16_t PreHeatDur_tmp;

static bool StartSig=false;
static bool ACrequest=false;
static bool initbyStart=false;
static bool initbyCharge=false;
static bool initbyPreHeat=false;
static bool OutlanderCAN=false;

static volatile unsigned
days=0,
hours=0, minutes=0, seconds=0,
alarm=0;			// != 0 when alarm is pending

static uint16_t rlyDly=25;
static uint16_t prechargeMinTime=100;

// Instantiate Classes
static BMW_E31 e31Vehicle;
static BMW_E65 e65Vehicle;
static BMW_E39 e39Vehicle;
static Can_VAG vagVehicle;
static SubaruVehicle subaruVehicle;
static GS450HClass gs450Inverter;
static LeafINV leafInv;
static NissanPDM chargerPDM;
static teslaCharger ChargerTesla;
static ElconCharger ChargerElcon;
static notused UnUsed;
static noCharger nochg;
static extCharger chgdigi;
static amperaCharger ampChg;
static outlanderCharger outChg;
static FCChademo chademoFC;
static i3LIMClass LIMFC;
static CPCClass CPCcan;
static FoccciClass Focccican;
static Can_OI openInv;
static NoInverterClass NoInverter;
static OutlanderInverter outlanderInv;
static noHeater Heaternone;
static AmperaHeater amperaHeater;
static OutlanderCanHeater outlanderCanHeater;
static no_Lever NoGearLever;
static F30_Lever F30GearLever;
static E65_Lever E65GearLever;
static JLR_G1 JLRG1shift;
static JLR_G2 JLRG2shift;
static vwHeater heaterVW;
static NoVehicle VehicleNone;
static V_Classic classVehicle;
static Inverter* selectedInverter = &openInv;
static Vehicle* selectedVehicle = &VehicleNone;
static Heater* selectedHeater = &Heaternone;
static Chargerhw* selectedCharger = &chargerPDM;
static Chargerint* selectedChargeInt = &UnUsed;
static Shifter* selectedShifter = &NoGearLever;
static BMS BMSnone;
static SimpBMS BMSsimp;
static LeafBMS BMSleaf;
static DaisychainBMS BMSdaisychain;
static KangooBMS BMSRenaultKangoo33;
static DCDC DCDCnone;
static TeslaDCDC DCDCTesla;
static BMS* selectedBMS = &BMSnone;
static DCDC* selectedDCDC = &DCDCnone;
static Can_OBD2 canOBD2;
static Shifter shifterNone;
static RearOutlanderInverter rearoutlanderInv;
static LinBus* lin;

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void Ms200Task(void)
{
    int opmode = Param::GetInt(Param::opmode);

    selectedVehicle->Task200Ms();
    if(opmode==MOD_CHARGE) selectedCharger->Task200Ms();

    //if(opmode==MOD_CHARGE) utils::CpSpoofOutput;
    utils::CpSpoofOutput();

    Param::SetInt(Param::Day,days);
    Param::SetInt(Param::Hour,hours);
    Param::SetInt(Param::Min,minutes);
    Param::SetInt(Param::Sec,seconds);
    Param::SetInt(Param::ChgT,ChgDur_tmp);
    if(ChgSet==2 && !ChgLck)  //if in timer mode and not locked out from a previous full charge.
    {
        if(opmode!=MOD_CHARGE)
        {
            if((ChgHrs_tmp==hours)&&(ChgMins_tmp==minutes)&&(ChgDur_tmp!=0))RunChg=true;//if we arrive at set charge time and duration is non zero then initiate charge
            else RunChg=false;
        }

        if(opmode==MOD_CHARGE)
        {
            if(ChgTicks!=0)
            {
                ChgTicks--; //decrement charge timer ticks
                ChgTicks_1Min++;
            }

