jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
            if(ChgTicks==0)
            {
                RunChg=false; //end charge if still charging once timer expires.
                ChgTicks = (GetInt(Param::Chg_Dur)*300);//recharge the tick timer
            }

            if (ChgTicks_1Min==300)
            {
                ChgTicks_1Min=0;
                ChgDur_tmp--; //countdown minutes of charge time remaining.
            }
        }

        if (opmode==MOD_PREHEAT) {
            if(PreheatTicks!=0)
            {
                PreheatTicks--; //decrement charge timer ticks
                PreheatTicks_1Min++;
            }

            if(PreheatTicks==0)
            {
                RunPreHeat=false; //end preheat
                PreheatTicks = (GetInt(Param::Pre_Dur)*300);//recharge the tick timer
            }

            if (PreheatTicks_1Min==300)
            {
                PreheatTicks_1Min=0;
                PreHeatDur_tmp--; //countdown minutes of charge time remaining.
            }
        }

    }
    if(ChgSet==0 && !ChgLck) RunChg=true;//enable from webui if we are not locked out from an auto termination
    if(ChgSet==1) RunChg=false;//disable from webui

    //Handle PP on the Charging port
    if(Param::GetInt(Param::GPA1Func) == IOMatrix::PILOT_PROX || Param::GetInt(Param::GPA2Func) == IOMatrix::PILOT_PROX )
    {
        int ppThresh = Param::GetInt(Param::ppthresh);

        int ppValue = IOMatrix::GetAnaloguePin(IOMatrix::PILOT_PROX)->Get();
        Param::SetInt(Param::PPVal, ppValue);


        //if PP is less than threshold and currently disabled and not already finished
        if (ppValue < ppThresh && ChgSet==1 && !ChgLck)
        {
            RunChg=true;
        }
        else if (ppValue > ppThresh)
        {
            //even if timer was enabled, change to disabled, we've unplugged
            RunChg=false;
        }
    }

    if(selectedCharger->ControlCharge(RunChg, ACrequest) && (opmode != MOD_RUN))
    {
        chargeMode = true;   //AC charge mode
        Param::SetInt(Param::chgtyp,AC);
    }
    else if(!chargeModeDC)
    {
        Param::SetInt(Param::chgtyp,OFF);
        chargeMode = false;  //no charge mode
    }

    //in chademo , we do not want to run the 200ms task unless in dc charge mode
    if(targetChgint == ChargeInterfaces::Chademo && chargeModeDC) selectedChargeInt->Task200Ms();
    //In case of the LIM we want to send it all the time if lim in use
    if((targetChgint == ChargeInterfaces::i3LIM) || (targetChgint == ChargeInterfaces::Unused) || (targetChgint == ChargeInterfaces::CPC)|| (targetChgint == ChargeInterfaces::Foccci)) selectedChargeInt->Task200Ms();
    //and just to be thorough ...
    if(targetChgint == ChargeInterfaces::Unused) selectedChargeInt->Task200Ms();



    ///////////////////////////////////////
    //Charge term logic for AC charge
    ///////////////////////////////////////
    /*
    if we are in charge mode and battV >= setpoint and power is <= termination setpoint
        Then we end charge.
    */
    if(opmode==MOD_CHARGE && !chargeModeDC)
    {
        if(Param::GetInt(Param::udc)>=Param::GetInt(Param::Voltspnt) && Param::GetInt(Param::idc)<=Param::GetInt(Param::IdcTerm))
        {
            RunChg=false;//end charge
            ChgLck=true;//set charge lockout flag
        }

        if(selectedBMS->MaxChargeCurrent()==0)//BMS can command an AC charge shutdown if its current limit is 0
        {
            RunChg=false;//end charge
            ChgLck=true;//set charge lockout flag
        }


    }
    if(opmode==MOD_RUN)
    {
        ChgLck=false;//reset charge lockout flag when we drive off

        //Brake Vac Sensor
        if(Param::GetInt(Param::GPA1Func) == IOMatrix::VAC_SENSOR || Param::GetInt(Param::GPA2Func) == IOMatrix::VAC_SENSOR )
        {
            int brkVacThresh = Param::GetInt(Param::BrkVacThresh);
            int BrkVacHyst = Param::GetInt(Param::BrkVacHyst);

            int brkVacVal = IOMatrix::GetAnaloguePin(IOMatrix::VAC_SENSOR)->Get();
            Param::SetInt(Param::BrkVacVal, brkVacVal);

            // if brkVacThresh > BrkVacHyst then sensor reads higher with more vacuum else other way round
            if (brkVacThresh > BrkVacHyst)
            {
                //enable pump
                if (brkVacVal > brkVacThresh)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
                }
                else if (brkVacVal < BrkVacHyst)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
                }
            }
            else
            {
                //enable pump
                if (brkVacVal < brkVacThresh)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
                }
                else if (brkVacVal > BrkVacHyst)
                {
                    IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Set();
                }
            }

        }
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::BRAKEVACPUMP)->Clear();
    }
    
    if(HeatSet==2)  //preheating
    {
        if(opmode!=MOD_PREHEAT)
        {
            if((PreHeatHrs_tmp==hours)&&(PreHeatMins_tmp==minutes)&&(PreHeatDur_tmp!=0)) {
                RunPreHeat = true;//if we arrive at set preheat time and duration is non zero then initiate preheat
            }
            else {
                RunPreHeat = false;
            } 
        }

        if(opmode==MOD_PREHEAT)
        {
            if(PreheatTicks!=0)
            {
                PreheatTicks--; //decrement charge timer ticks
                PreheatTicks_1Min++;
            }

            if(PreheatTicks==0)
            {
                RunPreHeat=false; //end preheat once timer expires.
                PreheatTicks = (GetInt(Param::Pre_Dur)*300);//recharge the tick timer
            }

            if (PreheatTicks_1Min==300)
            {
                PreheatTicks_1Min=0;
                PreHeatDur_tmp--; //countdown minutes of charge time remaining.
            }
        }

