jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
    }


}

static void Ms100Task(void)
{
    DigIo::led_out.Toggle();
    iwdg_reset();
    float cpuLoad = scheduler->GetCpuLoad() / 10.0f;
    Param::SetFloat(Param::cpuload, cpuLoad);
    Param::SetInt(Param::lasterr, ErrorMessage::GetLastError());
    int opmode = Param::GetInt(Param::opmode);
    utils::SelectDirection(selectedVehicle, selectedShifter);

    if(Param::GetInt(Param::ShuntType) != 0)//Do not do any SOC calcs
    {
        utils::CalcSOC();
    }

    Param::SetInt(Param::cruisestt, selectedVehicle->GetCruiseState());
    Param::SetFloat(Param::FrontRearBal, selectedVehicle->GetFrontRearBalance());

    utils::ProcessCruiseControlButtons();

    selectedInverter->Task100Ms();
    selectedVehicle->Task100Ms();
    selectedCharger->Task100Ms();
    selectedBMS->Task100Ms();
    selectedDCDC->Task100Ms();
    selectedShifter->Task100Ms();
    selectedHeater->Task100Ms();
    canMap->SendAll();

    if(OutlanderCAN == true)
    {
        OutlanderHeartBeat::Task100Ms();
    }

    if (Param::GetInt(Param::dir) < 0)
    {
        IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::REVERSELIGHT)->Clear();
    }

    if(opmode==MOD_RUN)
    {
        IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::RUNINDICATION)->Clear();
    }


    Param::SetFloat(Param::tmphs, selectedInverter->GetInverterTemperature()); //send inverter temp to web interface
    Param::SetFloat(Param::tmpm, selectedInverter->GetMotorTemperature()); //send motor temp to web interface
    Param::SetFloat(Param::InvStat, selectedInverter->GetInverterState()); //update inverter status on web interface
    Param::SetFloat(Param::INVudc, selectedInverter->GetInverterVoltage()); //display inverter derived dc link voltage on web interface

    Param::SetInt(Param::T15Stat, selectedVehicle->Ready());

    int32_t IsaTemp=ISA::Temperature;
    Param::SetInt(Param::tmpaux,IsaTemp);

    if(targetChgint == ChargeInterfaces::i3LIM || targetChgint == ChargeInterfaces::Foccci || chargeModeDC) selectedChargeInt->Task100Ms();// send the 100ms task request for the lim all the time and for others if in DC charge mode

    if(selectedChargeInt->DCFCRequest(RunChg))//Request to run dc fast charge
    {
        //Here we receive a valid DCFC startup request.
        if(opmode != MOD_RUN) chargeMode = true;// set charge mode to true to bring up hv
        chargeModeDC = true;   //DC charge mode on
    }
    else if(chargeModeDC)
    {
        Param::SetInt(Param::chgtyp,OFF);
        chargeMode = false;  //no charge mode
        chargeModeDC = false;   //DC charge mode off
    }

    if(!chargeModeDC)//Request to run ac charge from the interface (e.g. LIM) if we are NOT in DC charge mode.
    {
        ACrequest=selectedChargeInt->ACRequest(RunChg);
    }

    if (IOMatrix::GetPin(IOMatrix::HEATREQ) != &DigIo::dummypin)
    {
        Param::SetInt(Param::HeatReq,IOMatrix::GetPin(IOMatrix::HEATREQ)->Get());
    }

    DigiPot::SetPot1Step(); //just for dev
    DigiPot::SetPot2Step(); //just for dev

    //Cooling Fan Control//
    if(opmode==MOD_CHARGE || opmode==MOD_RUN)
    {
        float tempTemp = MAX(Param::GetFloat(Param::tmphs),Param::GetFloat(Param::ChgTemp));

        if(Param::GetFloat(Param::FanTemp) < tempTemp)
        {
            IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Set();//Coolant Fan On
        }
        else if((Param::GetFloat(Param::FanTemp)-5) > tempTemp)
        {
            IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Clear();//Coolant Fan Off
        }
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::COOLINGFAN)->Clear();//Coolant Fan Off
    }

    //HV Active output
    if(opmode==MOD_CHARGE || opmode==MOD_RUN || MOD_PREHEAT == opmode)
    {
        IOMatrix::GetPin(IOMatrix::HVACTIVE)->Set();//HV Active On
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::HVACTIVE)->Clear();//HV Active Off
    }

    if (opmode == MOD_OFF) {
        uint8_t testNegativeContactor = Param::GetInt(Param::TestNegCONT);
        if (testNegativeContactor == 1) {
            IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Set();
            Param::SetInt(Param::TestNegCONT, false);
            rlyDly = 5000;
        }
    }
}

static void ControlCabHeater(int opmode)
{
    Param::SetInt(Param::RunPreHeat, opmode);
    Param::SetInt(Param::RunPreHeatTest, (opmode == MOD_RUN && Param::GetInt(Param::Control) >= 1) || opmode == MOD_PRECHARGE);

    //Only run heater in run mode
    //What about charge mode and timer mode?
    // Param::GetInt(Param::Control) 1 is enable 2 is timer, but we still want to be able to request heat in drive mode
    if ((opmode == MOD_RUN && Param::GetInt(Param::Control) >= 1) || opmode == MOD_PRECHARGE)
    {
        IOMatrix::GetPin(IOMatrix::HEATERENABLE)->Set();//Heater enable and coolant pump on
        selectedHeater->SetTargetTemperature(50); //TODO: Currently does nothing
        selectedHeater->SetPower(Param::GetInt(Param::HeatPwr),Param::GetBool(Param::HeatReq));
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::HEATERENABLE)->Clear(); //Disable heater and coolant pump
        selectedHeater->SetPower(0,0);
    }
}

static void Ms10Task(void)
{
    static uint32_t vehicleStartTime = 0;

    int16_t previousSpeed=Param::GetInt(Param::speed);
    int16_t speed = 0;
    float torquePercent;
    int opmode = Param::GetInt(Param::opmode);
    int stt = STAT_NONE;
    int requestedDirection = Param::GetInt(Param::dir);
    int rollingDirection = 0;

    ErrorMessage::SetTime(rtc_get_counter_val());

    selectedChargeInt->Task10Ms();

    if (Param::GetInt(Param::opmode) == MOD_RUN) //!!!THROTTLE CODE HERE//
    {
        torquePercent = utils::ProcessThrottle(ABS(previousSpeed)); //run the throttle reading and checks and then generate Potnom


        //When requesting regen we need to be careful. If the car is not rolling
        //in the same direction as the selected gear, we will actually accelerate!
        //Exclude openinverter here because that has its own regen logic

        if (torquePercent < 0 && Param::GetInt(Param::Inverter) != InvModes::OpenI)
        {
            if(Param::GetInt(Param::reversemotor) == 0)
            {
                rollingDirection = previousSpeed >= 0 ? 1 : -1;
            }
            else
            {
                rollingDirection = previousSpeed >= 0 ? -1 : 1;
            }
            //When rolling backward while in forward gear, apply POSITIVE torque to slow down backward motion
            //Vice versa when in reverse gear and rolling forward.
            if (rollingDirection != requestedDirection)
            {
                torquePercent = -torquePercent;
            }
        }

