jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
        torquePercent *= requestedDirection; //torque requests invert when reverse direction is selected

        selectedInverter->Task10Ms();
    }
    else
    {
        torquePercent = 0;
        utils::displayThrottle();//just displays pot and pot2 when not in run mode to allow throttle cal
    }


    selectedInverter->SetTorque(torquePercent);


    if(Param::GetInt(Param::potnom) < Param::GetInt(Param::RegenBrakeLight))
    {
        Param::SetInt(Param::BrkVacVal,torquePercent*requestedDirection*-1);
        //enable Brake Light Ouput
        IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Set();
    }
    else
    {
        IOMatrix::GetPin(IOMatrix::BRAKELIGHT)->Clear();
    }

    //speed = ABS(selectedInverter->GetMotorSpeed());//set motor rpm on interface NO ABS allowed on speed as we need to know direction
    speed = selectedInverter->GetMotorSpeed();//set motor rpm on interface

    Param::SetInt(Param::speed, speed);
    utils::GetDigInputs(canInterface[Param::GetInt(Param::InverterCan)]);

    if(opmode==MOD_RUN || opmode==MOD_CHARGE) //only set rev counter when in RUN or CHARGE
    {
        selectedVehicle->SetRevCounter(ABS(speed)); //ABS allowed here to keep number from rolling over.
    }
    selectedVehicle->SetTemperatureGauge(Param::GetFloat(Param::tmphs));
    selectedVehicle->Task10Ms();
    selectedDCDC->Task10Ms();
    selectedShifter->Task10Ms();
    if(opmode==MOD_CHARGE) selectedCharger->Task10Ms();
    if(opmode==MOD_RUN) Param::SetInt(Param::canctr, (Param::GetInt(Param::canctr) + 1) & 0xF);//Update the OI can counter in RUN mode only

    //////////////////////////////////////////////////
    //            MODE CONTROL SECTION              //
    //////////////////////////////////////////////////
    float udc = utils::ProcessUdc(speed);
    stt |= Param::GetInt(Param::pot) <= Param::GetInt(Param::potmin) ? STAT_NONE : STAT_POTPRESSED;
    stt |= udc >= Param::GetFloat(Param::udcsw) ? STAT_NONE : STAT_UDCBELOWUDCSW;
    stt |= udc < Param::GetFloat(Param::udclim) ? STAT_NONE : STAT_UDCLIM;
    Param::SetInt(Param::status, stt);

    switch (opmode)
    {
    case MOD_OFF:
        initbyStart=false;
        initbyCharge=false;
        initbyPreHeat=false;
        DigIo::inv_out.Clear();//inverter power off
        IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Clear();//Coolant pump off if used
        Param::SetInt(Param::dir, 0); // shift to park/neutral on shutdown regardless of shifter pos
        selectedVehicle->DashOff();
        StartSig=false;//reset for next time

        if(rlyDly!=0) rlyDly--;//here we are going to pause to allow system shut down before opening HV contactors
        if(rlyDly==0)
        {
            DigIo::dcsw_out.Clear();
            IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Clear();//Negative contactors off if used
            DigIo::prec_out.Clear();
        }

        if(Param::GetInt(Param::pot) < Param::GetInt(Param::potmin))
        {
            if ((selectedVehicle->Start() && selectedVehicle->Ready()))
            {
                StartSig=true;
                opmode = MOD_PRECHARGE;//proceed to precharge if 1)throttle not pressed , 2)ign on , 3)start signal rx
                rlyDly=25;//Recharge sequence timer
                vehicleStartTime = rtc_get_counter_val();
                initbyStart=true;
            }
        }
        if(chargeMode)
        {
            opmode = MOD_PRECHARGE;//proceed to precharge if charge requested.
            rlyDly=25;//Recharge sequence timer
            vehicleStartTime = rtc_get_counter_val();
            initbyCharge=true;
        }
        if (RunPreHeat) {
            opmode = MOD_PRECHARGE;//proceed to precharge if charge requested.
            rlyDly=25;//Recharge sequence timer
            vehicleStartTime = rtc_get_counter_val();
            initbyPreHeat=true;
        }
        Param::SetInt(Param::opmode, opmode);
        break;

    case MOD_PRECHARGE:
        if (!chargeMode)
        {
            if(selectedInverter != &openInv)DigIo::inv_out.Set();//inverter power on but not if we are in charge mode and not if OI
        }
        else if((Param::GetInt(Param::ShuntType) == 0) && selectedInverter == &leafInv)//Shunt 0 + Leaf is precharge using leaf inverter voltage
        {
            DigIo::inv_out.Set(); //inverter power on
        }
        IOMatrix::GetPin(IOMatrix::NEGCONTACTOR)->Set();
        IOMatrix::GetPin(IOMatrix::COOLANTPUMP)->Set();
        if(rlyDly!=0) rlyDly--;//here we are going to pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0) DigIo::prec_out.Set();//commence precharge
        if(prechargeMinTime!=0) prechargeMinTime--;//1 second minimum precharge time
        if ((prechargeMinTime == 0 && stt & (STAT_POTPRESSED | STAT_UDCBELOWUDCSW | STAT_UDCLIM)) == STAT_NONE)
        {
            if(StartSig)
            {
                opmode = MOD_RUN;
                StartSig=false;//reset for next time
                rlyDly=25;//Recharge sequence timer
                Param::SetInt(Param::TorqDerate,0);//clear torque derate reason
            }
            else if(chargeMode)
            {
                opmode = MOD_CHARGE;
                rlyDly=25;//Recharge sequence timer
                Param::SetInt(Param::TorqDerate,0);//clear torque derate reason
            } else if (RunPreHeat) {
                opmode = MOD_PREHEAT;
                rlyDly=25;//Recharge sequence timer
                Param::SetInt(Param::TorqDerate,0);//clear torque derate reason
            }

        }
        if(initbyCharge && !chargeMode) opmode = MOD_OFF;// These two statements catch a precharge hang from either start mode or run mode.
        if(initbyStart && !selectedVehicle->Ready()) opmode = MOD_OFF;
        if(initbyPreHeat && !RunPreHeat) opmode = MOD_OFF;
        if (udc < (Param::GetInt(Param::udcsw)) && rtc_get_counter_val() > (vehicleStartTime + PRECHARGE_TIMEOUT))
        {
            DigIo::prec_out.Clear();
            ErrorMessage::Post(ERR_PRECHARGE);
            opmode = MOD_PCHFAIL;
        }
        Param::SetInt(Param::opmode, opmode);
        break;

    case MOD_PCHFAIL:
        StartSig=false;
        DigIo::prec_out.Clear();//explicitly turn off precharge relay in a fail condition
        if(initbyCharge && !chargeMode) opmode = MOD_OFF;//only go to off if the signal from charge or vehicle start is removed
        if(initbyStart && !selectedVehicle->Ready()) opmode = MOD_OFF;//this avoids oscillation in the event of a precharge system failure
        Param::SetInt(Param::opmode, opmode);
        break;

    case MOD_CHARGE:
        if(rlyDly!=0) rlyDly--;//here we are going to pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0)
        {
            DigIo::dcsw_out.Set();
        }
        ErrorMessage::UnpostAll();
        if(!chargeMode)
        {
            opmode = MOD_OFF;
            rlyDly=1000;//Recharge sequence timer for delayed shutdown
        }
        Param::SetInt(Param::opmode, opmode);
        break;

    case MOD_RUN:
        if(rlyDly!=0) rlyDly--;//here we are going to pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0)
        {
            DigIo::dcsw_out.Set();
            DigIo::inv_out.Set();//inverter power on
        }
        Param::SetInt(Param::opmode, MOD_RUN);
        ErrorMessage::UnpostAll();
        if(!selectedVehicle->Ready())
        {
            opmode = MOD_OFF;
            rlyDly=1000;//Recharge sequence timer for delayed shutdown
        }
        Param::SetInt(Param::opmode, opmode);
        break;
    case MOD_PREHEAT:
        if(rlyDly!=0) rlyDly--;//here we are going to pause before energising precharge to prevent too many contactors pulling amps at the same time
        if(rlyDly==0)
        {
            DigIo::dcsw_out.Set();
        }
        Param::SetInt(Param::opmode, MOD_PREHEAT);
        Param::SetInt(Param::HeatReq, true);
        ErrorMessage::UnpostAll();
        if(!RunPreHeat)
        {
            Param::SetInt(Param::opmode, MOD_OFF);
            Param::SetInt(Param::HeatReq, false);

