jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
static void UpdateShifter()
{

    switch (Param::GetInt(Param::GearLvr))
    {
    case ShifterModes::NoShifter:
        selectedShifter = &shifterNone;
        break;

    case ShifterModes::BMWF30:
        selectedShifter = &F30GearLever;
        break;

    case ShifterModes::JLRG1:
        selectedShifter = &JLRG1shift;
        break;

    case ShifterModes::JLRG2:
        selectedShifter = &JLRG2shift;
        break;

    case ShifterModes::BMWE65:
        selectedShifter = &E65GearLever;
        break;

    default:
        // Default to no shifter
        selectedShifter = &shifterNone;
        break;
    }
    //This will call SetCanFilters() via the Clear Callback
    canInterface[0]->ClearUserMessages();
    canInterface[1]->ClearUserMessages();
}


//Whenever the user clears mapped can messages or changes the
//CAN interface of a device, this will be called by the CanHardware module
static void SetCanFilters()
{
    CanHardware* inverter_can = canInterface[Param::GetInt(Param::InverterCan)];
    CanHardware* vehicle_can = canInterface[Param::GetInt(Param::VehicleCan)];
    CanHardware* shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];
    CanHardware* lim_can = canInterface[Param::GetInt(Param::LimCan)];
    CanHardware* charger_can = canInterface[Param::GetInt(Param::ChargerCan)];
    CanHardware* bms_can = canInterface[Param::GetInt(Param::BMSCan)];
    CanHardware* obd2_can = canInterface[Param::GetInt(Param::OBD2Can)];
    CanHardware* dcdc_can = canInterface[Param::GetInt(Param::DCDCCan)];
    CanHardware* heater_can = canInterface[Param::GetInt(Param::HeaterCan)];

    selectedInverter->SetCanInterface(inverter_can);
    selectedVehicle->SetCanInterface(vehicle_can);
    selectedCharger->SetCanInterface(charger_can);
    selectedChargeInt->SetCanInterface(lim_can);
    selectedBMS->SetCanInterface(bms_can);
    selectedDCDC->SetCanInterface(dcdc_can);
    selectedShifter->SetCanInterface(vehicle_can);
    canOBD2.SetCanInterface(obd2_can);
    selectedHeater->SetCanInterface(heater_can);

    if (Param::GetInt(Param::ShuntType) == 1)  ISA::RegisterCanMessages(shunt_can);//select isa shunt
    if (Param::GetInt(Param::ShuntType) == 2)  SBOX::RegisterCanMessages(shunt_can);//select bmw sbox
    if (Param::GetInt(Param::ShuntType) == 3)  VWBOX::RegisterCanMessages(shunt_can);//select vw sbox

    canInterface[1]->RegisterUserMessage(0x601); //CanSDO
    canInterface[0]->RegisterUserMessage(0x601); //CanSDO

}

void Param::Change(Param::PARAM_NUM paramNum)
{
    // This function is called when the user changes a parameter
    switch (paramNum)
    {
    case Param::Inverter:
        UpdateInv();
        break;
    case Param::Vehicle:
        UpdateVehicle();
        break;
    case Param::chargemodes:
        UpdateCharger();
        break;
    case Param::interface:
        UpdateChargeInt();
        break;
    case Param::Heater:
        UpdateHeater();
        break;
    case Param::BMS_Mode:
        UpdateBMS();
        break;
    case Param::DCdc_Type:
        UpdateDCDC();
        break;
    case Param::GearLvr:
        UpdateShifter();
        break;
    case Param::InverterCan:
    case Param::VehicleCan:
    case Param::ShuntCan:
    case Param::LimCan:
    case Param::ChargerCan:
        canInterface[0]->ClearUserMessages();
        canInterface[1]->ClearUserMessages();
        break;
    case Param::CAN3Speed:
        CANSPI_Initialize();// init the MCP25625 on CAN3
        CANSPI_ENRx_IRQ();  //init CAN3 Rx IRQ
        break;
    case Param::Tim3_Presc:
    case Param::Tim3_Period:
    case Param::Tim3_1_OC:
    case Param::Tim3_2_OC:
    case Param::Tim3_3_OC:
    case Param::PWM1Func:
    case Param::PWM2Func:
    case Param::PWM3Func:
        tim3_setup();
        break;
    case Param::CP_PWM:
        //timer_set_oc_value(TIM3, TIM_OC3, (Param::GetInt(Param::CP_PWM)*66)-16);//No duty set here
        break;
    default:
        break;
    }

    if(Param::GetInt(Param::reversemotor) != 0)
    {
        if(Param::GetInt(Param::Inverter) == InvModes::RearOutlander)
        {

        }
        else
        {
            Param::SetInt(Param::reversemotor,0);
        }
    }

    Throttle::potmin[0] = Param::GetInt(Param::potmin);
    Throttle::potmax[0] = Param::GetInt(Param::potmax);
    Throttle::potmin[1] = Param::GetInt(Param::pot2min);
    Throttle::potmax[1] = Param::GetInt(Param::pot2max);
    Throttle::regenRpm = Param::GetFloat(Param::regenrpm);
    Throttle::regenendRpm = Param::GetFloat(Param::regenendrpm);
    Throttle::ThrotRpmFilt = Param::GetFloat(Param::throtrpmfilt);
    if (Throttle::regenRpm < Throttle::regenendRpm)
    {
        Throttle::regenRpm = 1500;
        Throttle::regenendRpm = 100;
        Param::SetFloat(Param::regenrpm, 1500);
        Param::SetFloat(Param::regenendrpm, 100);
    }
    Throttle::regenmax = Param::GetFloat(Param::regenmax);
    Throttle::throtmax = Param::GetFloat(Param::throtmax);
    Throttle::throtmin = Param::GetFloat(Param::throtmin);
    Throttle::throtdead = Param::GetFloat(Param::throtdead);
    //Throttle::idcmin = Param::GetFloat(Param::idcmin); //Make them dynamic so code section can impact
    //Throttle::idcmax = Param::GetFloat(Param::idcmax);
    //Throttle::udcmin = Param::GetFloat(Param::udcmin);
    //Throttle::udcmax = Param::GetFloat(Param::udclim);
    Throttle::speedLimit = Param::GetInt(Param::revlim);
    Throttle::regenRamp = Param::GetFloat(Param::regenramp);
    Throttle::throttleRamp = Param::GetFloat(Param::throtramp);
    Throttle::throtmaxRev = Param::GetFloat(throtmaxRev);
    Throttle::regenBrake = Param::GetFloat(Param::regenBrake);

    targetCharger=static_cast<ChargeModes>(Param::GetInt(Param::chargemodes));//get charger setting from menu
    targetChgint=static_cast<ChargeInterfaces>(Param::GetInt(Param::interface));//get interface setting from menu
    if(ChgSet==1)
    {
        seconds=Param::GetInt(Param::Set_Sec);//only update these params if charge command is set to disable
        minutes=Param::GetInt(Param::Set_Min);
        hours=Param::GetInt(Param::Set_Hour);
        days=Param::GetInt(Param::Set_Day);
        ChgHrs_tmp=GetInt(Param::Chg_Hrs);
        ChgMins_tmp=GetInt(Param::Chg_Min);
        ChgDur_tmp=GetInt(Param::Chg_Dur);
    }
    ChgSet = Param::GetInt(Param::Chgctrl);//0=enable,1=disable,2=timer.
    ChgTicks = (GetInt(Param::Chg_Dur)*300);//number of 200ms ticks that equates to charge timer in minutes

    PreHeatHrs_tmp=GetInt(Param::Pre_Hrs);
    PreHeatMins_tmp=GetInt(Param::Pre_Min);
    HeatSet = Param::GetInt(Param::Control);//0=disable,1=enable,2=timer. Heater control
    PreheatTicks = (GetInt(Param::Pre_Dur)*300);//number of 200ms ticks that equates to preheat timer in minutes
    PreHeatDur_tmp = GetInt(Param::Pre_Dur);

    IOMatrix::AssignFromParams();
    IOMatrix::AssignFromParamsAnalogue();
}


static bool CanCallback(uint32_t id, uint32_t data[2], uint8_t dlc) //This is where we go when a defined CAN message is received.
{
    dlc = dlc;
    switch (id)
    {
    case 0x7DF:
        canOBD2.DecodeCAN(id,data);
        break;

    default:
        if (Param::GetInt(Param::ShuntType) == 1)  ISA::DecodeCAN(id, data);
        if (Param::GetInt(Param::ShuntType) == 2)  SBOX::DecodeCAN(id, data);
        if (Param::GetInt(Param::ShuntType) == 3)  VWBOX::DecodeCAN(id, data);
        selectedInverter->DecodeCAN(id, data);
        selectedVehicle->DecodeCAN(id, data);
        selectedCharger->DecodeCAN(id, data);
        selectedChargeInt->DecodeCAN(id, data);
        selectedBMS->DecodeCAN(id, (uint8_t*)data);
        selectedDCDC->DecodeCAN(id, (uint8_t*)data);
        selectedShifter->DecodeCAN(id,data);
        selectedHeater->DecodeCAN(id, data);
        break;
    }
    return false;
}


static void ConfigureVariantIO()
{
    ANA_IN_CONFIGURE(ANA_IN_LIST);
    DIG_IO_CONFIGURE(DIG_IO_LIST);

    AnaIn::Start();
}


extern "C" void tim4_isr(void)
{
    scheduler->Run();
}


extern "C" void exti15_10_isr(void)    //CAN3 MCP25625 interruppt
{
    uCAN_MSG rxMessage;
    uint32_t canData[2];
    if(CANSPI_receive(&rxMessage))
    {
        canData[0]=(rxMessage.frame.data0 | rxMessage.frame.data1<<8 | rxMessage.frame.data2<<16 | rxMessage.frame.data3<<24);
        canData[1]=(rxMessage.frame.data4 | rxMessage.frame.data5<<8 | rxMessage.frame.data6<<16 | rxMessage.frame.data7<<24);
    }
    //can cast this to uint32_t[2]. dont be an idiot! * pointer
    CANSPI_CLR_IRQ();   //Clear Rx irqs in mcp25625
    exti_reset_request(EXTI15); // clear irq
    if((rxMessage.frame.id==0x108)||(rxMessage.frame.id==0x109)) selectedChargeInt->DecodeCAN(rxMessage.frame.id, canData);

