jamiejones85/Stm32-vcu/src/stm32_vcu copy.cpp
}

extern "C" void rtc_isr(void)
{
    /* The interrupt flag isn't cleared by hardware, we have to do it. */
    rtc_clear_flag(RTC_SEC);

    if ( ++seconds >= 60 )
    {
        ++minutes;
        seconds -= 60;
    }
    if ( minutes >= 60 )
    {
        ++hours;
        minutes -= 60;
    }
    if ( hours >= 24 )
    {
        ++days;
        hours -= 24;
    }
}

extern "C" int main(void)
{
    extern const TERM_CMD TermCmds[];

    clock_setup();
    rtc_setup();
    ConfigureVariantIO();
    gpio_primary_remap(AFIO_MAPR_SWJ_CFG_JTAG_OFF_SW_ON, AFIO_MAPR_CAN2_REMAP | AFIO_MAPR_TIM1_REMAP_FULL_REMAP);//32f107
    usart2_setup();//TOYOTA HYBRID INVERTER INTERFACE
    nvic_setup();
    parm_load();
    spi2_setup();
    spi3_setup();
    tim3_setup(); //For general purpose PWM output
    Param::Change(Param::PARAM_LAST);
    DigIo::inv_out.Clear();//inverter power off during bootup
    DigIo::mcp_sby.Clear();//enable can3

    Terminal t(USART3, TermCmds);
//   FunctionPointerCallback canCb(CanCallback, SetCanFilters);
    Stm32Can c(CAN1, CanHardware::Baud500);
    Stm32Can c2(CAN2, CanHardware::Baud500, true);
    FunctionPointerCallback cb(CanCallback, SetCanFilters);
    Stm32Can *CanMapDev = &c;
    if (Param::GetInt(Param::CanMapCan) == 0)
    {
        CanMapDev = &c;
    }
    else
    {
        CanMapDev = &c2;
    }
    CanMap cm(CanMapDev);
    CanSdo sdo(&c, &cm);
    sdo.SetNodeId(3);//id 3 for vcu?
    // Set up CAN 1 callback and messages to listen for
//  c.AddReceiveCallback(&canCb);
//  c2.AddReceiveCallback(&canCb);
    canInterface[0] = &c;
    canInterface[1] = &c2;
    c.AddCallback(&cb);
    c2.AddCallback(&cb);
    TerminalCommands::SetCanMap(&cm);
    canMap = &cm;

    CanHardware* shunt_can = canInterface[Param::GetInt(Param::ShuntCan)];

    canOBD2.SetCanInterface(canInterface[Param::GetInt(Param::OBD2Can)]);

    CANSPI_Initialize();// init the MCP25625 on CAN3
    CANSPI_ENRx_IRQ();  //init CAN3 Rx IRQ

    LinBus l(USART1, 19200);
    lin = &l;

    UpdateInv();
    UpdateVehicle();
    UpdateCharger();
    UpdateChargeInt();
    UpdateBMS();
    UpdateHeater();
    UpdateDCDC();
    UpdateShifter();

    Stm32Scheduler s(TIM4); //We never exit main so it's ok to put it on stack
    scheduler = &s;

    s.AddTask(Ms1Task, 1);
    s.AddTask(Ms10Task, 10);
    s.AddTask(Ms100Task, 100);
    s.AddTask(Ms200Task, 200);

    if(Param::GetInt(Param::IsaInit)==1) ISA::initialize(shunt_can);//only call this once if a new sensor is fitted.


    Param::SetInt(Param::version, 4); //backward compatibility
    Param::SetInt(Param::opmode, MOD_OFF);//always off at startup

    while(1)
    {
        char c = 0;
        t.Run();
        if (sdo.GetPrintRequest() == PRINT_JSON)
        {
            TerminalCommands::PrintParamsJson(&sdo, &c);
        }
    }

    return 0;
}
